SpacehuhnTech/arduino-samd/boards.txt
########## Generated boards.txt ##########

menu.keyboardid=USB Device ID
menu.protocol=Protocol
menu.debug=Debug
menu.ledpin=Neopixel (WS2812b)
menu.dipin=Dotstar (APA102) DI Pin
menu.cipin=Dotstar (APA102) CI Pin
menu.bridge=Serial Bridge
menu.bridgebutton=Serial Bridge Enable Pin
menu.bridgerst=Serial Bridge Reset Pin
menu.bridge0=Serial Bridge GPIO-0 Pin

########## Adafruit Trinket M0 (SAMD21) ##########

trinket_m0.name=Adafruit Trinket M0 (SAMD21)

trinket_m0.build.variant=trinket_m0
trinket_m0.upload.tool=bossac
trinket_m0.upload.protocol=sam-ba
trinket_m0.upload.maximum_size=262144
trinket_m0.upload.offset=0x2000
trinket_m0.upload.use_1200bps_touch=true
trinket_m0.upload.wait_for_upload_port=true
trinket_m0.upload.native_usb=true

trinket_m0.bootloader.tool=openocd
trinket_m0.bootloader.file=trinketm0/bootloader-trinket_m0-v2.0.0-adafruit.5.bin

trinket_m0.build.mcu=cortex-m0plus
trinket_m0.build.f_cpu=48000000L
trinket_m0.build.board=TRINKET_M0
trinket_m0.build.core=arduino
trinket_m0.build.extra_flags=-DCRYSTALLESS -DADAFRUIT_TRINKET_M0 -D__SAMD21E18A__ -DARM_MATH_CM0PLUS {build.usb_flags}
trinket_m0.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
trinket_m0.build.openocdscript=openocd_scripts/trinket_m0.cfg


# Dotstar DI #
trinket_m0.build.di_pin=-DDOTSTAR -DDOTSTAR_NUM=1 -DDOTSTAR_DI=7

# Dotstar CI #
trinket_m0.build.ci_pin=-DDOTSTAR_CI=8

# Keyboard ID #
trinket_m0.menu.keyboardid.default=Adafruit Trinket M0
trinket_m0.menu.keyboardid.default.build.vid=0x239A
trinket_m0.menu.keyboardid.default.build.pid=0x801E
trinket_m0.menu.keyboardid.default.build.usb_product="Trinket M0"
trinket_m0.menu.keyboardid.default.build.usb_manufacturer="Adafruit"

trinket_m0.menu.keyboardid.apple=Apple Aluminium Keyboard
trinket_m0.menu.keyboardid.apple.build.vid=0x05ac
trinket_m0.menu.keyboardid.apple.build.pid=0x0221
trinket_m0.menu.keyboardid.apple.build.usb_product="Aluminium Keyboard"
trinket_m0.menu.keyboardid.apple.build.usb_manufacturer="Apple"

trinket_m0.menu.keyboardid.appleint=Apple Internal Keyboard/Trackpad
trinket_m0.menu.keyboardid.appleint.build.vid=0x05ac
trinket_m0.menu.keyboardid.appleint.build.pid=0x0259
trinket_m0.menu.keyboardid.appleint.build.usb_product="Internal Keyboard/Trackpad"
trinket_m0.menu.keyboardid.appleint.build.usb_manufacturer="Apple"

trinket_m0.menu.keyboardid.logitechhid=Logitech USB Keyboard
trinket_m0.menu.keyboardid.logitechhid.build.vid=0x046d
trinket_m0.menu.keyboardid.logitechhid.build.pid=0xc316
trinket_m0.menu.keyboardid.logitechhid.build.usb_product="USB Keyboard"
trinket_m0.menu.keyboardid.logitechhid.build.usb_manufacturer="Logitech"

trinket_m0.menu.keyboardid.logitechgaming=Logitech G910 Keyboard
trinket_m0.menu.keyboardid.logitechgaming.build.vid=0x046d
trinket_m0.menu.keyboardid.logitechgaming.build.pid=0xc335
trinket_m0.menu.keyboardid.logitechgaming.build.usb_product="G910 Keyboard"
trinket_m0.menu.keyboardid.logitechgaming.build.usb_manufacturer="Logitech"

trinket_m0.menu.keyboardid.ms=Microsoft USB Keyboard
trinket_m0.menu.keyboardid.ms.build.vid=0x045e
trinket_m0.menu.keyboardid.ms.build.pid=0xfff8
trinket_m0.menu.keyboardid.ms.build.usb_product="USB Keyboard"
trinket_m0.menu.keyboardid.ms.build.usb_manufacturer="Microsoft"

# Protocol #
trinket_m0.menu.protocol.auto=Auto (I2C & Serial)
trinket_m0.menu.protocol.auto.build.protocol_flags=-DENABLE_I2C -DENABLE_SERIAL

trinket_m0.menu.protocol.i2c=I2C
trinket_m0.menu.protocol.i2c.build.protocol_flags=-DENABLE_I2C

trinket_m0.menu.protocol.serial=Serial
trinket_m0.menu.protocol.serial.build.protocol_flags=-DENABLE_SERIAL

# Debug #
trinket_m0.menu.debug.serial=Serial (115200b, newline)
trinket_m0.menu.debug.serial.build.debug_flags=-DENABLE_DEBUG -DDEBUG_PORT=Serial -DDEBUG_BAUD=115200

trinket_m0.menu.debug.disabled=Disabled
trinket_m0.menu.debug.disabled.build.debug_flags=

# Serial Bridge #
trinket_m0.menu.bridge.disabled=Disabled
trinket_m0.menu.bridge.disabled.build.bridge_flags=

trinket_m0.menu.bridge.serial1=Serial1
trinket_m0.menu.bridge.serial1.build.bridge_flags=-DBRIDGE_ENABLE -DBRIDGE_PORT=Serial1

trinket_m0.menu.bridge.serial1_inverted=Serial1 (inverted logic)
trinket_m0.menu.bridge.serial1_inverted.build.bridge_flags=-DBRIDGE_ENABLE -DBRIDGE_PORT=Serial1 -DBRIDGE_0_INVERTED

trinket_m0.menu.bridgebutton.disabled=Disabled
trinket_m0.menu.bridgebutton.0=0 (A2)
trinket_m0.menu.bridgebutton.0.build.bridge_button=-DBRIDGE_SWITCH=0
trinket_m0.menu.bridgebutton.1=1~ (A0)
trinket_m0.menu.bridgebutton.1.build.bridge_button=-DBRIDGE_SWITCH=1
trinket_m0.menu.bridgebutton.2=2 (A1)
trinket_m0.menu.bridgebutton.2.build.bridge_button=-DBRIDGE_SWITCH=2
trinket_m0.menu.bridgebutton.3=3 (A3) (RX)
trinket_m0.menu.bridgebutton.3.build.bridge_button=-DBRIDGE_SWITCH=3
trinket_m0.menu.bridgebutton.4=4 (A4) (TX)
trinket_m0.menu.bridgebutton.4.build.bridge_button=-DBRIDGE_SWITCH=4
trinket_m0.menu.bridgebutton.7=7 (DI)
trinket_m0.menu.bridgebutton.7.build.bridge_button=-DBRIDGE_SWITCH=7
trinket_m0.menu.bridgebutton.8=8 (CI)
trinket_m0.menu.bridgebutton.8.build.bridge_button=-DBRIDGE_SWITCH=8
trinket_m0.menu.bridgebutton.19=19 (SWCLK)
trinket_m0.menu.bridgebutton.19.build.bridge_button=-DBRIDGE_SWITCH=19
trinket_m0.menu.bridgebutton.20=20 (SWDIO)
trinket_m0.menu.bridgebutton.20.build.bridge_button=-DBRIDGE_SWITCH=20

trinket_m0.menu.bridgerst.disabled=Disabled
trinket_m0.menu.bridgerst.0=0 (A2)
trinket_m0.menu.bridgerst.0.build.bridge_rst=-DBRIDGE_RST=0
trinket_m0.menu.bridgerst.1=1~ (A0)
trinket_m0.menu.bridgerst.1.build.bridge_rst=-DBRIDGE_RST=1
trinket_m0.menu.bridgerst.2=2 (A1)
trinket_m0.menu.bridgerst.2.build.bridge_rst=-DBRIDGE_RST=2
trinket_m0.menu.bridgerst.3=3 (A3) (RX)
trinket_m0.menu.bridgerst.3.build.bridge_rst=-DBRIDGE_RST=3
trinket_m0.menu.bridgerst.4=4 (A4) (TX)
trinket_m0.menu.bridgerst.4.build.bridge_rst=-DBRIDGE_RST=4
trinket_m0.menu.bridgerst.7=7 (DI)
trinket_m0.menu.bridgerst.7.build.bridge_rst=-DBRIDGE_RST=7
trinket_m0.menu.bridgerst.8=8 (CI)
trinket_m0.menu.bridgerst.8.build.bridge_rst=-DBRIDGE_RST=8
trinket_m0.menu.bridgerst.19=19 (SWCLK)
trinket_m0.menu.bridgerst.19.build.bridge_rst=-DBRIDGE_RST=19
trinket_m0.menu.bridgerst.20=20 (SWDIO)
trinket_m0.menu.bridgerst.20.build.bridge_rst=-DBRIDGE_RST=20

trinket_m0.menu.bridge0.disabled=Disabled
trinket_m0.menu.bridge0.0=0 (A2)
trinket_m0.menu.bridge0.0.build.bridge_0=-DBRIDGE_0=0
trinket_m0.menu.bridge0.1=1~ (A0)
trinket_m0.menu.bridge0.1.build.bridge_0=-DBRIDGE_0=1
trinket_m0.menu.bridge0.2=2 (A1)
trinket_m0.menu.bridge0.2.build.bridge_0=-DBRIDGE_0=2
trinket_m0.menu.bridge0.3=3 (A3) (RX)
trinket_m0.menu.bridge0.3.build.bridge_0=-DBRIDGE_0=3
trinket_m0.menu.bridge0.4=4 (A4) (TX)
trinket_m0.menu.bridge0.4.build.bridge_0=-DBRIDGE_0=4
trinket_m0.menu.bridge0.7=7 (DI)
trinket_m0.menu.bridge0.7.build.bridge_0=-DBRIDGE_0=7
trinket_m0.menu.bridge0.8=8 (CI)
trinket_m0.menu.bridge0.8.build.bridge_0=-DBRIDGE_0=8
trinket_m0.menu.bridge0.19=19 (SWCLK)
trinket_m0.menu.bridge0.19.build.bridge_0=-DBRIDGE_0=19
trinket_m0.menu.bridge0.20=20 (SWDIO)
trinket_m0.menu.bridge0.20.build.bridge_0=-DBRIDGE_0=20

########## Project Sero (SAMD) ##########

project_sero.name=Project Sero (SAMD)

project_sero.build.variant=project_sero
project_sero.upload.tool=bossac
project_sero.upload.protocol=sam-ba
project_sero.upload.maximum_size=262144
project_sero.upload.offset=0x2000
project_sero.upload.use_1200bps_touch=true
project_sero.upload.wait_for_upload_port=true
project_sero.upload.native_usb=true

project_sero.bootloader.tool=openocd
project_sero.bootloader.file=trinketm0/bootloader-trinket_m0-v2.0.0-adafruit.5.bin

project_sero.build.mcu=cortex-m0plus
project_sero.build.f_cpu=48000000L
project_sero.build.board=TRINKET_M0
project_sero.build.core=arduino
project_sero.build.extra_flags=-DCRYSTALLESS -DADAFRUIT_TRINKET_M0 -D__SAMD21E18A__ -DARM_MATH_CM0PLUS {build.usb_flags}
project_sero.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
project_sero.build.openocdscript=openocd_scripts/trinket_m0.cfg


# Protocol #
project_sero.build.protocol_flags=-DENABLE_SERIAL

# Dotstar DI #
project_sero.build.di_pin=-DDOTSTAR -DDOTSTAR_NUM=1 -DDOTSTAR_DI=7

# Dotstar CI #
project_sero.build.ci_pin=-DDOTSTAR_CI=8

# Serial Bridge #
project_sero.build.bridge_flags=-DBRIDGE_ENABLE -DBRIDGE_PORT=Serial1 -DBRIDGE_0_INVERTED

project_sero.build.bridge_button=-DBRIDGE_SWITCH=1

project_sero.build.bridge_rst=-DBRIDGE_RST=2

project_sero.build.bridge_0=-DBRIDGE_0=0

# Keyboard ID #
project_sero.menu.keyboardid.default=Adafruit Trinket M0
project_sero.menu.keyboardid.default.build.vid=0x239A
project_sero.menu.keyboardid.default.build.pid=0x801E
project_sero.menu.keyboardid.default.build.usb_product="Trinket M0"
project_sero.menu.keyboardid.default.build.usb_manufacturer="Adafruit"

project_sero.menu.keyboardid.apple=Apple Aluminium Keyboard
project_sero.menu.keyboardid.apple.build.vid=0x05ac
project_sero.menu.keyboardid.apple.build.pid=0x0221
project_sero.menu.keyboardid.apple.build.usb_product="Aluminium Keyboard"
project_sero.menu.keyboardid.apple.build.usb_manufacturer="Apple"

project_sero.menu.keyboardid.appleint=Apple Internal Keyboard/Trackpad
project_sero.menu.keyboardid.appleint.build.vid=0x05ac
project_sero.menu.keyboardid.appleint.build.pid=0x0259
project_sero.menu.keyboardid.appleint.build.usb_product="Internal Keyboard/Trackpad"
project_sero.menu.keyboardid.appleint.build.usb_manufacturer="Apple"

project_sero.menu.keyboardid.logitechhid=Logitech USB Keyboard
project_sero.menu.keyboardid.logitechhid.build.vid=0x046d
project_sero.menu.keyboardid.logitechhid.build.pid=0xc316
project_sero.menu.keyboardid.logitechhid.build.usb_product="USB Keyboard"
project_sero.menu.keyboardid.logitechhid.build.usb_manufacturer="Logitech"

project_sero.menu.keyboardid.logitechgaming=Logitech G910 Keyboard
project_sero.menu.keyboardid.logitechgaming.build.vid=0x046d
project_sero.menu.keyboardid.logitechgaming.build.pid=0xc335
project_sero.menu.keyboardid.logitechgaming.build.usb_product="G910 Keyboard"
project_sero.menu.keyboardid.logitechgaming.build.usb_manufacturer="Logitech"

project_sero.menu.keyboardid.ms=Microsoft USB Keyboard
project_sero.menu.keyboardid.ms.build.vid=0x045e
project_sero.menu.keyboardid.ms.build.pid=0xfff8
project_sero.menu.keyboardid.ms.build.usb_product="USB Keyboard"
project_sero.menu.keyboardid.ms.build.usb_manufacturer="Microsoft"

# Debug #
project_sero.menu.debug.serial=Serial (115200b, newline)
project_sero.menu.debug.serial.build.debug_flags=-DENABLE_DEBUG -DDEBUG_PORT=Serial -DDEBUG_BAUD=115200

project_sero.menu.debug.disabled=Disabled
project_sero.menu.debug.disabled.build.debug_flags=

